УправлениеВетеринарнойКлиникой/src/Documents/Осмотр/Осмотр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Осмотр</name>
  <basedOn>Document.ЗаписьНаПрием</basedOn>
  <registerRecords>InformationRegister.МедицинскиеКарты</registerRecords>
  <attributes>
    <name>ЗаписьНаПрием</name>
    <type>
      <types>DocumentRef.ЗаписьНаПрием</types>
    </type>
  </attributes>
  <attributes>
    <name>Питомец</name>
    <type>
      <types>CatalogRef.Питомцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Хозяин</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Врач</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОсмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Жалобы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееСостояние</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Диагноз</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОсмотра</name>
    <type>
      <types>EnumRef.СтатусыОсмотра</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Назначения</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Дозировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПрименения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОказанныеУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеВетеринарнойКлиникой/src/InformationRegisters/МедицинскиеКарты/МедицинскиеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МедицинскиеКарты</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Диагноз</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Жалобы</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Назначения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Рекомендации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Осмотр</name>
    <type>
      <types>DocumentRef.Осмотр</types>
    </type>
  </resources>
  <dimensions>
    <name>Питомец</name>
    <type>
      <types>CatalogRef.Питомцы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Врач</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеВетеринарнойКлиникой/src/Documents/Осмотр/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр МедицинскиеКарты
	Движения.МедицинскиеКарты.Записывать = Истина;
	Движение = Движения.МедицинскиеКарты.Добавить();
	Движение.Питомец = Питомец;
	Движение.Дата = Дата;
	Движение.Врач = Врач;
	Движение.Диагноз = Диагноз;
	Движение.Жалобы = Жалобы;
	Движение.Рекомендации = Рекомендации;
	Движение.Осмотр = Ссылка;
	Движение.Назначения = СформироватьТекстНазначений();

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаписьНаПрием") Тогда
		// Заполнение шапки
		ЗаписьНаПрием = ДанныеЗаполнения.Ссылка;
		Питомец = ДанныеЗаполнения.Питомец;
		Хозяин = ДанныеЗаполнения.Клиент;
		Врач = ДанныеЗаполнения.Врач;
		ДатаОсмотра = ДанныеЗаполнения.ДатаВремяНачала;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьТекстНазначений()
    
    ТекстНазначений = "";
    
    Для Каждого СтрокаТабличнойЧасти Из Назначения Цикл
        Если СтрокаТабличнойЧасти.Товар <> Неопределено Тогда
            // Формируем строку с информацией о назначении
            ТекстСтрокиНазначения = СтрокаТабличнойЧасти.Товар.Наименование + " - " +
                                   СтрокаТабличнойЧасти.Дозировка + ", " +
                                   СтрокаТабличнойЧасти.СпособПрименения + ", " +
                                   СтрокаТабличнойЧасти.Периодичность + ", " +
                                   СтрокаТабличнойЧасти.Продолжительность;
            
            // Добавляем примечание, если оно есть
            Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Примечание) Тогда
                ТекстСтрокиНазначения = ТекстСтрокиНазначения + " (" + СтрокаТабличнойЧасти.Примечание + ")";
            КонецЕсли;
            
            // Добавляем разделитель между назначениями
            ТекстНазначений = ТекстНазначений + ТекстСтрокиНазначения + Символы.ПС;
        КонецЕсли;
    КонецЦикла;
    
    // Убираем последний символ перевода строки, если он есть
    Если ТекстНазначений <> "" Тогда
        ТекстНазначений = Лев(ТекстНазначений, СтрДлина(ТекстНазначений) - 1);
    КонецЕсли;
    
    Возврат ТекстНазначений;
    
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
